docs/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-09-30 Thu 16:04 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Ansible</title>
<meta name="author" content="VTX IT Department" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="style.css">
</head>
<body>
<div id="content" class="content">
<h1 class="title">Ansible</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org6188abb">Deploy</a></li>
<li><a href="#orga115ffc">Playbooks</a>
<ul>
<li><a href="#org3d91970">Ping</a></li>
<li><a href="#org17a33e9">Sidekiq</a>
<ul>
<li><a href="#orgd0169f8">Provision Service</a></li>
<li><a href="#orgc1903c1">Restart Sidekiq</a></li>
</ul>
</li>
<li><a href="#orgc5db550">Nginx Webserver</a>
<ul>
<li><a href="#org86890f6">Append Nginx Configuration</a></li>
<li><a href="#orgd7b16cc">Restart Nginx</a></li>
</ul>
</li>
<li><a href="#org2c7897d">Logrotate</a></li>
<li><a href="#org74a6eba">Maintenance</a></li>
</ul>
</li>
<li><a href="#org1abfd82">Provision ERP</a></li>
<li><a href="#org9fc80d2">Tower</a></li>
</ul>
</div>
</div>
<p>
This repository is a collection of ansible playbooks implemented by Vertilux&rsquo;s IT dept to perform some server automations.
</p>

<div id="outline-container-org6188abb" class="outline-2">
<h2 id="org6188abb">Deploy</h2>
<div class="outline-text-2" id="text-org6188abb">
<p>
This playbook contains multiples roles to deploy new versions to production.
</p>
</div>
</div>

<div id="outline-container-orga115ffc" class="outline-2">
<h2 id="orga115ffc">Playbooks</h2>
<div class="outline-text-2" id="text-orga115ffc">
<p>
A collections o simple playbooks to perform different tasks.
</p>
</div>

<div id="outline-container-org3d91970" class="outline-3">
<h3 id="org3d91970">Ping</h3>
<div class="outline-text-3" id="text-org3d91970">
<p>
Try to connect to host, verify a usable python and return <code>pong</code> on success.
</p>

<div class="org-src-container">
<pre class="src src-bash">ansible-playbook ping.yml -i inventory
</pre>
</div>
</div>
</div>

<div id="outline-container-org17a33e9" class="outline-3">
<h3 id="org17a33e9">Sidekiq</h3>
<div class="outline-text-3" id="text-org17a33e9">
<p>
Background processing for ruby. Sidekiq uses threads to handle jobs at the same time in the same process. It is integrated tightly with Rails to make background processing dead simple.
</p>
</div>

<div id="outline-container-orgd0169f8" class="outline-4">
<h4 id="orgd0169f8">Provision Service</h4>
<div class="outline-text-4" id="text-orgd0169f8">
<p>
Running sidekiq as a system service with systemd, this will ensure the process is restarted if Sidekiq crashes.
Here is an example systemd file:
</p>

<pre class="example">
[Unit]
Description=sidekiq
After=syslog.target network.target

[Service]
Type=simple
WorkingDirectory=/home/deploy/APP_LOCATION/current
ExecStart=/home/deploy/.rbenv/shims/bundle exec sidekiq -e ENVIRONMENT
User=deploy
Group=deploy
UMask=0002

# Greatly reduce Ruby memory fragmentation and heap usage
# https://www.mikeperham.com/2018/04/25/taming-rails-memory-bloat/
Environment=MALLOC_ARENA_MAX=2

# if we crash, restart
RestartSec=1
Restart=on-failure

# output goes to /var/log/syslog
StandardOutput=syslog
StandardError=syslog

# This will default to "bundler" if we don't specify it
SyslogIdentifier=sidekiq

[Install]
WantedBy=multi-user.target
</pre>

<p>
With the following playbook the service is provision on all servers.
</p>

<div class="org-src-container">
<pre class="src src-bash">ansible-playbook sidekiq_service.yml -K -i inventory.yml
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc1903c1" class="outline-4">
<h4 id="orgc1903c1">Restart Sidekiq</h4>
<div class="outline-text-4" id="text-orgc1903c1">
<div class="org-src-container">
<pre class="src src-bash">ansible-playbook restart-sidekiq.yml -K -i inventory.yml
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc5db550" class="outline-3">
<h3 id="orgc5db550">Nginx Webserver</h3>
<div class="outline-text-3" id="text-orgc5db550">
<p>
Nginx is a web server that can be used as a reverse proxy, load balancer and HTTP cache.
</p>
</div>

<div id="outline-container-org86890f6" class="outline-4">
<h4 id="org86890f6">Append Nginx Configuration</h4>
<div class="outline-text-4" id="text-org86890f6">
<p>
This playbook will append a configuration block to the default configuration with the env passed. This is the easy way to when deploying a new distribution center.
</p>

<div class="org-src-container">
<pre class="src src-bash">ansible-playbook append-nginx-config.yml -K -i inventory.yml
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd7b16cc" class="outline-4">
<h4 id="orgd7b16cc">Restart Nginx</h4>
<div class="outline-text-4" id="text-orgd7b16cc">
<p>
Simply restart nginx on all servers excluding load labancer.
</p>

<div class="org-src-container">
<pre class="src src-bash">ansible-playbook restart-nginx.yml -K -i inventory.yml
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org2c7897d" class="outline-3">
<h3 id="org2c7897d">Logrotate</h3>
<div class="outline-text-3" id="text-org2c7897d">
<p>
Configuring Logrotate For Rails Production Logs.
Running <code>ansible-playbook append-logrotate.yml --extra-vars "env=ENV" -K -i inventory.yml</code> will edit <code>sudo vim /etc/logrotate.conf</code>, and at the bottom of the file the following block of code (change the ENV, ex: accltd):
</p>

<pre class="example">
/home/deploy/erp-ENV/current/log/*.log {
  daily
  missingok
  rotate 7
  compress
  delaycompress
  notifempty
  copytruncate
}
</pre>

<div class="org-src-container">
<pre class="src src-bash">ansible-playbook append-logrotate.yml -K -i inventory.yml
</pre>
</div>

<p>
<b>How it works:</b>
</p>
<ul class="org-ul">
<li>daily – Rotate the log files each day.</li>
<li>missingok – If the log file doesn’t exist, ignore it.</li>
<li>rotate 7 – Only keep 7 days of logs.</li>
<li>compress – GZip the log file on rotation.</li>
<li>delaycompress – Rotate the file one day, then compress it the next day so we can be sure that it won’t interfere with the Rails server.</li>
<li>notifempty – Don’t rotate the file if the logs are empty.</li>
<li>copytruncate – Copy the log file and then empties it.</li>
</ul>

<p>
<b>Running Logrotate:</b>
Then the playbook will run: `sudo /usr/sbin/logrotate -f /etc/logrotate.conf`
</p>
</div>
</div>

<div id="outline-container-org74a6eba" class="outline-3">
<h3 id="org74a6eba">Maintenance</h3>
<div class="outline-text-3" id="text-org74a6eba">
<p>
Sometimes there is a need to set the ERP Web application into maintenance mode; when an item change needs to be run or when the we need to upgrade Sage. For this scenarios the folloging playbook is the easier way to set all instances in maintenance mode.
</p>

<p>
Set only one distribution center to maintenance mode.
</p>
<div class="org-src-container">
<pre class="src src-bash">ansible-playbook maintenance-mode.yml -K -i inventory.yml
</pre>
</div>

<p>
Put everything into maintenance.
</p>
<div class="org-src-container">
<pre class="src src-bash">ansible-playbook maintenance-mode-all.yml -K -i inventory.yml
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-org1abfd82" class="outline-2">
<h2 id="org1abfd82">Provision ERP</h2>
<div class="outline-text-2" id="text-org1abfd82">
<p>
Roles to provision a new distribution center (environment) to production.
</p>
</div>
</div>

<div id="outline-container-org9fc80d2" class="outline-2">
<h2 id="org9fc80d2">Tower</h2>
<div class="outline-text-2" id="text-org9fc80d2">
<p>
A collections of playbooks to perform tasks with the tower web interface.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: VTX IT Department</p>
<p class="date">Created: 2021-09-30 Thu 16:04</p>
</div>
</body>
</html>
